#### BoundingBoxXYZ Members

---

|  |
| --- |
| BoundingBoxXYZ Class   Constructors   Methods   Properties   See Also |

The  BoundingBoxXYZ  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | BoundingBoxXYZ | Constructs a new BoundingBoxXYZ with a default transform and extents of (-100, -100, -100) to (100, 100, 100). |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BoundEnabled | Indexed access for loops. |
| Public property | Bounds | Indexed access for loops. Use 0 for Min and 1 for Max. |
| Public property | Enabled | Defines whether the entire bounding box is enabled. |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |
| Public property | IsSet | Indicates whether the bounding box is set. |
| Public property | Max | Maximum coordinates (upper-right-front corner of the box). |
| Public property | MaxEnabled | Defines whether the maximum bound is active for given dimension. |
| Public property | Min | Minimum coordinates (lower-left-rear corner of the box). |
| Public property | MinEnabled | Defines whether the minimum bound is active for given dimension. |
| Public property | Transform | The transform from the coordinate space of the box to the model coordinate space. |

# See Also

BoundingBoxXYZ Class

Autodesk.Revit.DB Namespace